Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core1/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOB
mcu_data: ksdk2_0
processor_version: 0.2412.10
board: MIMXRT700-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDEBUG_UARTPins_Sense();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins_Sense:
- options: {callFromInitBoot: 'true', coreID: cm33_core1, enableClock: 'true'}
- pin_list:
  - {pin_num: R10, peripheral: LP_FLEXCOMM19, signal: P0, pin_signal: PIO8_14/LP_FLEXCOMM19_P0/CTIMER7_MAT2/SAI3_TX_SYNC/I3C2_SDA, input_buffer: enable}
  - {pin_num: T10, peripheral: LP_FLEXCOMM19, signal: P1, pin_signal: PIO8_15/LP_FLEXCOMM19_P1/CTIMER7_MAT3/SAI3_TX_BCLK/I3C2_SCL}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins_Sense
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #1) */
void BOARD_InitDEBUG_UARTPins_Sense(void)
{
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t RT_P8_14_FC19_RXD = (/* Pin is configured as LP_FLEXCOMM19_P0 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT8 PIN14 (coords: R10) is configured as LP_FLEXCOMM19_P0 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_14_FC19_RXD_PORT, BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_14_FC19_RXD_PIN, RT_P8_14_FC19_RXD);

    const uint32_t RT_P8_15_FC19_TXD = (/* Pin is configured as LP_FLEXCOMM19_P1 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT8 PIN15 (coords: T10) is configured as LP_FLEXCOMM19_P1 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_15_FC19_TXD_PORT, BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_15_FC19_TXD_PIN, RT_P8_15_FC19_TXD);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI3CPins_Sense:
- options: {callFromInitBoot: 'false', coreID: cm33_core1, enableClock: 'true'}
- pin_list:
  - {pin_num: T8, peripheral: I3C3, signal: PUR, pin_signal: PIO8_20/LP_FLEXCOMM19_P6/CTIMER_S_INP7/UTICK1_CAP2/I3C3_PUR, input_buffer: enable}
  - {pin_num: R9, peripheral: I3C3, signal: SDA, pin_signal: PIO8_21/LP_FLEXCOMM20_P3/CTIMER5_MAT0/LP_FLEXCOMM3_P0/I3C3_SDA, input_buffer: enable}
  - {pin_num: N9, peripheral: I3C3, signal: SCL, pin_signal: PIO8_22/LP_FLEXCOMM20_P4/CTIMER5_MAT1/LP_FLEXCOMM3_P1/I3C3_SCL, input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI3CPins_Sense
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #1) */
void BOARD_InitI3CPins_Sense(void)
{
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t I3C3_PUR = (/* Pin is configured as I3C3_PUR */
                               IOPCTL_PIO_FUNC4 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT8 PIN20 (coords: T8) is configured as I3C3_PUR */
    IOPCTL_PinMuxSet(BOARD_INITI3CPINS_SENSE_I3C3_PUR_PORT, BOARD_INITI3CPINS_SENSE_I3C3_PUR_PIN, I3C3_PUR);

    const uint32_t I3C3_SDA = (/* Pin is configured as I3C3_SDA */
                               IOPCTL_PIO_FUNC4 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT8 PIN21 (coords: R9) is configured as I3C3_SDA */
    IOPCTL_PinMuxSet(BOARD_INITI3CPINS_SENSE_I3C3_SDA_PORT, BOARD_INITI3CPINS_SENSE_I3C3_SDA_PIN, I3C3_SDA);

    const uint32_t I3C3_SCL = (/* Pin is configured as I3C3_SCL */
                               IOPCTL_PIO_FUNC4 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT8 PIN22 (coords: N9) is configured as I3C3_SCL */
    IOPCTL_PinMuxSet(BOARD_INITI3CPINS_SENSE_I3C3_SCL_PORT, BOARD_INITI3CPINS_SENSE_I3C3_SCL_PIN, I3C3_SCL);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins_Sense:
- options: {callFromInitBoot: 'false', coreID: cm33_core1, enableClock: 'true'}
- pin_list:
  - {pin_num: T13, peripheral: GPIO8, signal: 'GPIO, 6', pin_signal: PIO8_6/LP_FLEXCOMM17_P1/CTIMER6_MATCH0/CMP0_OUT, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins_Sense
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #1) */
void BOARD_InitLEDsPins_Sense(void)
{

    /* Enables the clock for the GPIO8 module */
    CLOCK_EnableClock(kCLOCK_Gpio8);

    gpio_pin_config_t P8_6_PWM_RED_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO8_6 (pin T13)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_GPIO, BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_PIN, &P8_6_PWM_RED_LED_config);
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t P8_6_PWM_RED_LED = (/* Pin is configured as PIO8_6 */
                                       IOPCTL_PIO_FUNC0 |
                                       /* Disable pull-up / pull-down function */
                                       IOPCTL_PIO_PUPD_DI |
                                       /* Enable pull-down function */
                                       IOPCTL_PIO_PULLDOWN_EN |
                                       /* Disable input buffer function */
                                       IOPCTL_PIO_INBUF_DI |
                                       /* Normal mode */
                                       IOPCTL_PIO_SLEW_RATE_NORMAL |
                                       /* Analog mux is disabled */
                                       IOPCTL_PIO_ANAMUX_DI |
                                       /* Pseudo Output Drain is disabled */
                                       IOPCTL_PIO_PSEDRAIN_DI |
                                       /* Input function is not inverted */
                                       IOPCTL_PIO_INV_DI);
    /* PORT8 PIN6 (coords: T13) is configured as PIO8_6 */
    IOPCTL_PinMuxSet(BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_PORT, BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_PIN, P8_6_PWM_RED_LED);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins_Sense:
- options: {callFromInitBoot: 'false', coreID: cm33_core1, enableClock: 'true'}
- pin_list:
  - {pin_num: U13, peripheral: GPIO8, signal: 'GPIO, 5', pin_signal: PIO8_5/LP_FLEXCOMM17_P0/CTIMER5_MAT3/CTIMER_S_INP0, direction: INPUT, input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins_Sense
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #1) */
void BOARD_InitBUTTONsPins_Sense(void)
{

    /* Enables the clock for the GPIO8 module */
    CLOCK_EnableClock(kCLOCK_Gpio8);

    gpio_pin_config_t USER_Button3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO8_5 (pin U13)  */
    GPIO_PinInit(BOARD_INITBUTTONSPINS_SENSE_USER_Button3_GPIO, BOARD_INITBUTTONSPINS_SENSE_USER_Button3_PIN, &USER_Button3_config);
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t USER_Button3 = (/* Pin is configured as PIO8_5 */
                                   IOPCTL_PIO_FUNC0 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Normal mode */
                                   IOPCTL_PIO_SLEW_RATE_NORMAL |
                                   /* Analog mux is disabled */
                                   IOPCTL_PIO_ANAMUX_DI |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI);
    /* PORT8 PIN5 (coords: U13) is configured as PIO8_5 */
    IOPCTL_PinMuxSet(BOARD_INITBUTTONSPINS_SENSE_USER_Button3_PORT, BOARD_INITBUTTONSPINS_SENSE_USER_Button3_PIN, USER_Button3);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
